
# type = 1(城市), 2(原野)
map_data = \
    [    # en_name,      zh_name,                       type   BGM                             可前往的地圖
        ["prontera",     "盧恩 米德加茲王國 首都 普隆德拉", 1,     "prontera",                     [2, 6, 7, 9]],
        ["prt_fild00",   "普隆德拉 區域0",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild01",   "普隆德拉 區域1",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild02",   "普隆德拉 區域2",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild03",   "普隆德拉 區域3",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild04",   "普隆德拉 區域4",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild05",   "普隆德拉 區域5",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild06",   "普隆德拉 區域6",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild07",   "普隆德拉 區域7",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild08",   "普隆德拉 區域8",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild09",   "普隆德拉 區域9",                2,     "prt_fild09_10_11",             []],
        ["prt_fild10",   "普隆德拉 區域10",               2,     "prt_fild09_10_11",             []],
        ["prt_fild11",   "普隆德拉 區域11",               2,     "prt_fild09_10_11",             []],
        ["geffen",       "魔法之都 吉芬",                 1,     "geffen",                       []],
        ["gef_fild00",   "吉芬 區域0",                   2,     "gef_fild00_04_07",             []],
        ["gef_fild01",   "吉芬 區域1",                   2,     "gef_fild01_05_06_08_09",       []],
        ["gef_fild02",   "吉芬 區域2",                   2,     "gef_fild02_03_10",             []],
        ["gef_fild03",   "吉芬 區域3",                   2,     "gef_fild02_03_10",             []],
        ["gef_fild04",   "吉芬 區域4",                   2,     "gef_fild00_04_07",             []],
        ["gef_fild05",   "吉芬 區域5",                   2,     "gef_fild01_05_06_08_09",       []],
        ["gef_fild06",   "吉芬 區域6",                   2,     "gef_fild01_05_06_08_09",       []],
        ["gef_fild07",   "吉芬 區域7",                   2,     "gef_fild00_04_07",             []],
        ["gef_fild08",   "吉芬 區域8",                   2,     "gef_fild01_05_06_08_09",       []],
        ["gef_fild09",   "吉芬 區域9",                   2,     "gef_fild01_05_06_08_09",       []],
        ["gef_fild10",   "吉芬 區域10",                  2,     "gef_fild02_03_10",             []],
        ["gef_fild11",   "吉芬 區域11",                  2,     "gef_fild11",                   []]
    ]


if __name__ == "__main__":
    print(len(map_data))
