
# type = 1(城市), 2(原野)
map_data = \
    [    # en_name,      zh_name,                       type   BGM                             可前往的地圖
        ["prontera",     "盧恩 米德加茲王國 首都 普隆德拉", 1,     "prontera",                     [2, 6, 7, 9]],
        ["prt_fild00",   "普隆德拉 區域0",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild01",   "普隆德拉 區域1",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild02",   "普隆德拉 區域2",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild03",   "普隆德拉 區域3",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild04",   "普隆德拉 區域4",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild05",   "普隆德拉 區域5",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild06",   "普隆德拉 區域6",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild07",   "普隆德拉 區域7",                2,     "prt_fild00_02_03_04_07",       []],
        ["prt_fild08",   "普隆德拉 區域8",                2,     "prt_fild01_05_06_08",          [0]],
        ["prt_fild09",   "普隆德拉 區域9",                2,     "prt_fild09_10_11",             []],
        ["prt_fild10",   "普隆德拉 區域10",               2,     "prt_fild09_10_11",             []],
        ["prt_fild11",   "普隆德拉 區域11",               2,     "prt_fild09_10_11",             []],
    ]
